app/controllers/masscans_controller.rb

  def index
    @masscans = Masscan.all
---
SELECT "masscans".* FROM "masscans"

  def show
        @masscan = Masscan.find(params[:id])
---
SELECT  "masscans".* FROM "masscans" WHERE "masscans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]