app/controllers/nmapscans_controller.rb

SELECT "nmapscans".* FROM "nmapscans"
---
  def create
#  	render plain: params[:nmapscan].inspect
#=begin
  	command = "nmap "

  	if params[:nmapscan][:fragment].present? == true