app/controllers/nmapscans_controller.rb

SELECT "nmapscans".* FROM "nmapscans"
---
  def index
    @nmapscans = Nmapscan.all

SELECT  "nmapscans".* FROM "nmapscans" WHERE "nmapscans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @nmapscan = Nmapscan.find(params[:id])

INSERT INTO "nmapscans" ("filename", "target", "port", "fragment", "os", "service_version", "safe", "vuln", "speed", "ping", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @nmapscan = Nmapscan.new(nmapscan_params)

    respond_to do |format|
      if @nmapscan.save

SELECT  "nmapscans".* FROM "nmapscans" WHERE "nmapscans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "nmapscans" WHERE "nmapscans"."id" = ?  [["id", 1]]
---
  def destroy
    @nmapscan = Nmapscan.find(params[:id])
    @nmapscan.destroy