app/controllers/welcome_controller.rb

SELECT  "nmapscans".* FROM "nmapscans" ORDER BY "nmapscans"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @nmapscans = Nmapscan.all